src/openforms/payments/contrib/ogone/tests/files/vcr_cassettes/OgoneClientTest/OgoneClientTest.test_payment_request_valid_order_id.yaml

interactions:
- request:
    body: PSPID=maykinmedia&ORDERID=xyz2024%2FOF-123456%2F987654321&AMOUNT=1000&CURRENCY=EUR&LANGUAGE=nl_NL&PMLISTTYPE=2&ACCEPTURL=http%3A%2F%2Ffoo.bar%2Freturn%3Fbazz%3Dbuzz%26action%3Daccept&DECLINEURL=http%3A%2F%2Ffoo.bar%2Freturn%3Fbazz%3Dbuzz%26action%3Dcancel&EXCEPTIONURL=http%3A%2F%2Ffoo.bar%2Freturn%3Fbazz%3Dbuzz%26action%3Dexception&CANCELURL=http%3A%2F%2Ffoo.bar%2Freturn%3Fbazz%3Dbuzz%26action%3Dcancel&BACKURL=http%3A%2F%2Ffoo.bar%2Freturn%3Fbazz%3Dbuzz%26action%3Dcancel&SHASIGN=7D59105FA08F72341447A871074D100C886A7CD3E80CDF17019B9FC7007B92885037248F991D034CF728C52321B044E77532084BD20BA1F0DCAF6A82EF7DCE4D
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate, br
      Connection:
      - keep-alive
      Content-Length:
      - '612'
      Content-Type:
      - application/x-www-form-urlencoded
      User-Agent:
      - python-requests/2.32.4
    method: POST
    uri: https://ogone.test.v-psp.com/ncol/test/orderstandard_utf8.asp
  response:
    body:
      string: '<head><title>Object moved</title></head>

        <body><h1>Object Moved</h1>This object may be found <a HREF="https://ogone.test.v-psp.com/payment/hostedpage/51f7ee3220ad494fa5735acdc243b888">here</a>.</body>

        '
    headers:
      cache-control:
      - private, max-age=0
      content-length:
      - '201'
      content-security-policy:
      - script-src 'self' 'nonce-13F811CC7DF2B60DA5A271863C399D6C62ECA24C3A9122ACC107996F3F46E555'
        'unsafe-eval' https://static-eu.payments-amazon.com/cba/js/ https://images-na.ssl-images-amazon.com/images/G/
        https://external-assets.test.cdn.v-psp.com/t/ https://secure.ogone.com/Ncol/Test/
      content-type:
      - text/html; Charset=utf-8
      date:
      - Tue, 01 Jul 2025 07:37:23 GMT
      expires:
      - Tue, 01 Jul 2025 07:36:21 GMT
      location:
      - https://ogone.test.v-psp.com/payment/hostedpage/51f7ee3220ad494fa5735acdc243b888
      set-cookie:
      - sessionTest=620bf36d-b471-43d2-ac7d-36fb0cdee85c; path=/ncol/test/; Secure;
        HttpOnly
      strict-transport-security:
      - max-age=16000000; includeSubDomains; preload;
      x-content-type-options:
      - nosniff
    status:
      code: 302
      message: Object moved
- request:
    body: null
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate, br
      Connection:
      - keep-alive
      User-Agent:
      - python-requests/2.32.4
    method: GET
    uri: https://ogone.test.v-psp.com/payment/hostedpage/51f7ee3220ad494fa5735acdc243b888
  response:
    body:
      string: ''
    headers:
      content-length:
      - '0'
      correlation-id:
      - 5c56b762-00cd-4e24-a87a-60587f7f4a8a
      - 5c56b762-00cd-4e24-a87a-60587f7f4a8a
      date:
      - Tue, 01 Jul 2025 07:37:22 GMT
      location:
      - https://simulator.test.v-psp.com/web-simulator/Ideal/Index?returnurl=https%3a%2f%2fogone.test.v-psp.com%2fpayment%2freturn%2ff9503de8e1f54532a86838492f85fbf2
      strict-transport-security:
      - max-age=16000000; includeSubDomains; preload;
    status:
      code: 302
      message: Found
- request:
    body: null
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate, br
      Connection:
      - keep-alive
      User-Agent:
      - python-requests/2.32.4
    method: GET
    uri: https://simulator.test.v-psp.com/web-simulator/Ideal/Index?returnurl=https%3A%2F%2Fogone.test.v-psp.com%2Fpayment%2Freturn%2Ff9503de8e1f54532a86838492f85fbf2
  response:
    body:
      string: "<!DOCTYPE html>\r\n<html lang=\"en\">\r\n<head>\r\n    <meta charset=\"utf-8\"
        />\r\n    <meta name=\"viewport\" content=\"width=device-width, initial-scale=1.0\">\r\n
        \   <title>iDEAL Simulator</title>\r\n    <link href=\"https://simulator.test.v-psp.com/web-simulator/Content/default.css\"
        rel=\"stylesheet\" type=\"text/css\" />\r\n</head>\r\n<body>\r\n\r\n    <div
        id=\"header\">\r\n        <h1>iDEAL</h1>\r\n        <p>This page simulates
        iDEAL payments</p>\r\n    </div>\r\n\r\n    <div id=\"main\">\r\n        \r\n<form
        action=\"https://ogone.test.v-psp.com/payment/return/f9503de8e1f54532a86838492f85fbf2\"
        method=\"GET\" name=\"redirectForm\" id=\"redirectForm\">\r\n        <input
        type=\"hidden\" name=\"ec\" />\r\n        <input type=\"hidden\" name=\"trxid\"
        value=\"0\" />\r\n\r\n    <div class=\"section first\">\r\n        <h2>Redirection</h2>\r\n
        \       <ul>\r\n            <li>Redirect to domain: ogone.test.v-psp.com</li>\r\n
        \           <li><a class=\"btn btn-primary btn-lg submit-link\" id=\"lnk_redirect\">Redirect
        &raquo;</a></li>\r\n            <li>or close this browser window to simulate
        an interrupted redirection</li>\r\n        </ul>\r\n    </div>\r\n\r\n\r\n<div
        class=\"section last\">\r\n    <h2>Details of the payment</h2>\r\n    <ul>\r\n
        \       <li id=\"payid\">Payid: 0</li>\r\n        <li id=\"trxid\">TransactionId:
        0</li>\r\n        <li id=\"issuer\">Issuer: </li>\r\n    </ul>\r\n</div>\r\n</form>\r\n
        \   </div>\r\n</body>\r\n</html>\r\n<script src=\"https://simulator.test.v-psp.com/web-simulator/Content/main.js\"
        type=\"text/javascript\"></script>"
    headers:
      content-security-policy:
      - default-src 'self'; script-src 'self'
      content-type:
      - text/html; charset=utf-8
      correlation-id:
      - 7e0c9a04-0b3c-4057-8514-37119bc7fb6a
      - 7e0c9a04-0b3c-4057-8514-37119bc7fb6a
      date:
      - Tue, 01 Jul 2025 07:37:22 GMT
      pragma:
      - no-cache
      strict-transport-security:
      - max-age=16000000; includeSubDomains; preload;
      transfer-encoding:
      - chunked
      x-content-type-options:
      - nosniff
      x-frame-options:
      - DENY
      x-xss-protection:
      - 1; mode=block
    status:
      code: 200
      message: OK
version: 1
