src/openforms/payments/contrib/ogone/tests/files/vcr_cassettes/OgoneClientTest/test_payment_request_valid_order_id.yaml

interactions:
- request:
    body: PSPID=maykinmedia&ORDERID=xyz2024%2FOF-123456%2F987654321&AMOUNT=1000&CURRENCY=EUR&LANGUAGE=nl_NL&PMLISTTYPE=2&ACCEPTURL=http%3A%2F%2Ffoo.bar%2Freturn%3Fbazz%3Dbuzz%26action%3Daccept&DECLINEURL=http%3A%2F%2Ffoo.bar%2Freturn%3Fbazz%3Dbuzz%26action%3Dcancel&EXCEPTIONURL=http%3A%2F%2Ffoo.bar%2Freturn%3Fbazz%3Dbuzz%26action%3Dexception&CANCELURL=http%3A%2F%2Ffoo.bar%2Freturn%3Fbazz%3Dbuzz%26action%3Dcancel&BACKURL=http%3A%2F%2Ffoo.bar%2Freturn%3Fbazz%3Dbuzz%26action%3Dcancel&SHASIGN=7D59105FA08F72341447A871074D100C886A7CD3E80CDF17019B9FC7007B92885037248F991D034CF728C52321B044E77532084BD20BA1F0DCAF6A82EF7DCE4D
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate, br
      Connection:
      - keep-alive
      Content-Length:
      - '612'
      Content-Type:
      - application/x-www-form-urlencoded
      User-Agent:
      - python-requests/2.32.4
    method: POST
    uri: https://ogone.test.v-psp.com/ncol/test/orderstandard_utf8.asp
  response:
    body:
      string: '<head><title>Object moved</title></head>

        <body><h1>Object Moved</h1>This object may be found <a HREF="https://ogone.test.v-psp.com/payment/hostedpage/851776df1a79412cab2f6863db0300fc">here</a>.</body>

        '
    headers:
      cache-control:
      - private, max-age=0
      content-length:
      - '201'
      content-security-policy:
      - script-src 'self' 'nonce-EBF819B8C3AD5C906DEDCBAA34B725DEC4685209F01425FA88D78BF1583B79E0'
        'unsafe-eval' https://static-eu.payments-amazon.com/cba/js/ https://images-na.ssl-images-amazon.com/images/G/
        https://external-assets.test.cdn.v-psp.com/t/ https://secure.ogone.com/Ncol/Test/
      content-type:
      - text/html; Charset=utf-8
      date:
      - Mon, 18 Aug 2025 10:51:37 GMT
      expires:
      - Mon, 18 Aug 2025 10:50:36 GMT
      location:
      - https://ogone.test.v-psp.com/payment/hostedpage/851776df1a79412cab2f6863db0300fc
      set-cookie:
      - sessionTest=8245abf1-bdb4-4804-9d8a-bd6913cab92f; path=/ncol/test/; Secure;
        HttpOnly
      strict-transport-security:
      - max-age=16000000; includeSubDomains; preload;
      x-content-type-options:
      - nosniff
    status:
      code: 302
      message: Object moved
- request:
    body: null
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate, br
      Connection:
      - keep-alive
      User-Agent:
      - python-requests/2.32.4
    method: GET
    uri: https://ogone.test.v-psp.com/payment/hostedpage/851776df1a79412cab2f6863db0300fc
  response:
    body:
      string: ''
    headers:
      content-length:
      - '0'
      correlation-id:
      - 4f6ae40f-2519-4066-b3c1-5934df258a68
      - 4f6ae40f-2519-4066-b3c1-5934df258a68
      date:
      - Mon, 18 Aug 2025 10:51:36 GMT
      location:
      - https://simulator.test.v-psp.com/web-simulator/Ideal/Index?returnurl=https%3a%2f%2fogone.test.v-psp.com%2fpayment%2freturn%2fe38e1be8b9cb4c38ba0972c196f59f51
      strict-transport-security:
      - max-age=16000000; includeSubDomains; preload;
    status:
      code: 302
      message: Found
- request:
    body: null
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate, br
      Connection:
      - keep-alive
      User-Agent:
      - python-requests/2.32.4
    method: GET
    uri: https://simulator.test.v-psp.com/web-simulator/Ideal/Index?returnurl=https%3A%2F%2Fogone.test.v-psp.com%2Fpayment%2Freturn%2Fe38e1be8b9cb4c38ba0972c196f59f51
  response:
    body:
      string: "<!DOCTYPE html>\r\n<html lang=\"en\">\r\n<head>\r\n    <meta charset=\"utf-8\"
        />\r\n    <meta name=\"viewport\" content=\"width=device-width, initial-scale=1.0\">\r\n
        \   <title>iDEAL Simulator</title>\r\n    <link href=\"https://simulator.test.v-psp.com/web-simulator/Content/default.css\"
        rel=\"stylesheet\" type=\"text/css\" />\r\n</head>\r\n<body>\r\n\r\n    <div
        id=\"header\">\r\n        <h1>iDEAL</h1>\r\n        <p>This page simulates
        iDEAL payments</p>\r\n    </div>\r\n\r\n    <div id=\"main\">\r\n        \r\n<form
        action=\"https://ogone.test.v-psp.com/payment/return/e38e1be8b9cb4c38ba0972c196f59f51\"
        method=\"GET\" name=\"redirectForm\" id=\"redirectForm\">\r\n        <input
        type=\"hidden\" name=\"ec\" />\r\n        <input type=\"hidden\" name=\"trxid\"
        value=\"0\" />\r\n\r\n    <div class=\"section first\">\r\n        <h2>Redirection</h2>\r\n
        \       <ul>\r\n            <li>Redirect to domain: ogone.test.v-psp.com</li>\r\n
        \           <li><a class=\"btn btn-primary btn-lg submit-link\" id=\"lnk_redirect\">Redirect
        &raquo;</a></li>\r\n            <li>or close this browser window to simulate
        an interrupted redirection</li>\r\n        </ul>\r\n    </div>\r\n\r\n\r\n<div
        class=\"section last\">\r\n    <h2>Details of the payment</h2>\r\n    <ul>\r\n
        \       <li id=\"payid\">Payid: 0</li>\r\n        <li id=\"trxid\">TransactionId:
        0</li>\r\n        <li id=\"issuer\">Issuer: </li>\r\n    </ul>\r\n</div>\r\n</form>\r\n
        \   </div>\r\n</body>\r\n</html>\r\n<script src=\"https://simulator.test.v-psp.com/web-simulator/Content/main.js\"
        type=\"text/javascript\"></script>"
    headers:
      content-security-policy:
      - default-src 'self'; script-src 'self'
      content-type:
      - text/html; charset=utf-8
      correlation-id:
      - 083dc599-6936-4eab-a59b-0d6a1fc92112
      - 083dc599-6936-4eab-a59b-0d6a1fc92112
      date:
      - Mon, 18 Aug 2025 10:51:37 GMT
      pragma:
      - no-cache
      strict-transport-security:
      - max-age=16000000; includeSubDomains; preload;
      transfer-encoding:
      - chunked
      x-content-type-options:
      - nosniff
      x-frame-options:
      - DENY
      x-xss-protection:
      - 1; mode=block
    status:
      code: 200
      message: OK
version: 1
