src/openforms/payments/contrib/ogone/tests/files/vcr_cassettes/OgoneClientTest/OgoneClientTest.test_com_title_unicode_chars.yaml

interactions:
- request:
    body: PSPID=maykinmedia&ORDERID=xyz2024%2FOF-123456%2F987654321&AMOUNT=1000&CURRENCY=EUR&LANGUAGE=nl_NL&TITLE=l%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4mp%21+l%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4mp%21+l%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4mp%21+l%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4mp%21+l%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4mp%21+l%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4mp%21+l%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4mp%21+l%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4mp%21+l%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4mp%21+l%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4%C3%A4mp%21&PMLISTTYPE=2&ACCEPTURL=http%3A%2F%2Ffoo.bar%2Freturn%3Fbazz%3Dbuzz%26action%3Daccept&DECLINEURL=http%3A%2F%2Ffoo.bar%2Freturn%3Fbazz%3Dbuzz%26action%3Dcancel&EXCEPTIONURL=http%3A%2F%2Ffoo.bar%2Freturn%3Fbazz%3Dbuzz%26action%3Dexception&CANCELURL=http%3A%2F%2Ffoo.bar%2Freturn%3Fbazz%3Dbuzz%26action%3Dcancel&BACKURL=http%3A%2F%2Ffoo.bar%2Freturn%3Fbazz%3Dbuzz%26action%3Dcancel&COM=br%C3%B8ther+i+desire+l%C3%B6%C3%B6ps&SHASIGN=EF6D7725AC3A447821DB9E5997FDC2A9B8F4A7403E091A45A25146E98950B6BF433EDEC00D1B7B542AF82C3912B64598F5A44493465C3C31070FE4DA4B72809B
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate, br
      Connection:
      - keep-alive
      Content-Length:
      - '1570'
      Content-Type:
      - application/x-www-form-urlencoded
      User-Agent:
      - python-requests/2.32.4
    method: POST
    uri: https://ogone.test.v-psp.com/ncol/test/orderstandard_utf8.asp
  response:
    body:
      string: '<head><title>Object moved</title></head>

        <body><h1>Object Moved</h1>This object may be found <a HREF="https://ogone.test.v-psp.com/payment/hostedpage/51f7ee3220ad494fa5735acdc243b888">here</a>.</body>

        '
    headers:
      cache-control:
      - private, max-age=0
      content-length:
      - '201'
      content-security-policy:
      - script-src 'self' 'nonce-B7335FF87085159EB48F0FC6D6B86F14E3B8E97DFB530113FF2C17034285F4FF'
        'unsafe-eval' https://static-eu.payments-amazon.com/cba/js/ https://images-na.ssl-images-amazon.com/images/G/
        https://external-assets.test.cdn.v-psp.com/t/ https://secure.ogone.com/Ncol/Test/
      content-type:
      - text/html; Charset=utf-8
      date:
      - Tue, 01 Jul 2025 07:37:20 GMT
      expires:
      - Tue, 01 Jul 2025 07:36:19 GMT
      location:
      - https://ogone.test.v-psp.com/payment/hostedpage/51f7ee3220ad494fa5735acdc243b888
      set-cookie:
      - sessionTest=1942e335-2d33-478d-9e70-1919989100b0; path=/ncol/test/; Secure;
        HttpOnly
      strict-transport-security:
      - max-age=16000000; includeSubDomains; preload;
      x-content-type-options:
      - nosniff
    status:
      code: 302
      message: Object moved
- request:
    body: null
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate, br
      Connection:
      - keep-alive
      User-Agent:
      - python-requests/2.32.4
    method: GET
    uri: https://ogone.test.v-psp.com/payment/hostedpage/51f7ee3220ad494fa5735acdc243b888
  response:
    body:
      string: ''
    headers:
      content-length:
      - '0'
      correlation-id:
      - b86949e5-07ca-470b-9516-d51e0b24ec59
      - b86949e5-07ca-470b-9516-d51e0b24ec59
      date:
      - Tue, 01 Jul 2025 07:37:20 GMT
      location:
      - https://simulator.test.v-psp.com/web-simulator/Ideal/Index?returnurl=https%3a%2f%2fogone.test.v-psp.com%2fpayment%2freturn%2ff9503de8e1f54532a86838492f85fbf2
      strict-transport-security:
      - max-age=16000000; includeSubDomains; preload;
    status:
      code: 302
      message: Found
- request:
    body: null
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate, br
      Connection:
      - keep-alive
      User-Agent:
      - python-requests/2.32.4
    method: GET
    uri: https://simulator.test.v-psp.com/web-simulator/Ideal/Index?returnurl=https%3A%2F%2Fogone.test.v-psp.com%2Fpayment%2Freturn%2Ff9503de8e1f54532a86838492f85fbf2
  response:
    body:
      string: "<!DOCTYPE html>\r\n<html lang=\"en\">\r\n<head>\r\n    <meta charset=\"utf-8\"
        />\r\n    <meta name=\"viewport\" content=\"width=device-width, initial-scale=1.0\">\r\n
        \   <title>iDEAL Simulator</title>\r\n    <link href=\"https://simulator.test.v-psp.com/web-simulator/Content/default.css\"
        rel=\"stylesheet\" type=\"text/css\" />\r\n</head>\r\n<body>\r\n\r\n    <div
        id=\"header\">\r\n        <h1>iDEAL</h1>\r\n        <p>This page simulates
        iDEAL payments</p>\r\n    </div>\r\n\r\n    <div id=\"main\">\r\n        \r\n<form
        action=\"https://ogone.test.v-psp.com/payment/return/f9503de8e1f54532a86838492f85fbf2\"
        method=\"GET\" name=\"redirectForm\" id=\"redirectForm\">\r\n        <input
        type=\"hidden\" name=\"ec\" />\r\n        <input type=\"hidden\" name=\"trxid\"
        value=\"0\" />\r\n\r\n    <div class=\"section first\">\r\n        <h2>Redirection</h2>\r\n
        \       <ul>\r\n            <li>Redirect to domain: ogone.test.v-psp.com</li>\r\n
        \           <li><a class=\"btn btn-primary btn-lg submit-link\" id=\"lnk_redirect\">Redirect
        &raquo;</a></li>\r\n            <li>or close this browser window to simulate
        an interrupted redirection</li>\r\n        </ul>\r\n    </div>\r\n\r\n\r\n<div
        class=\"section last\">\r\n    <h2>Details of the payment</h2>\r\n    <ul>\r\n
        \       <li id=\"payid\">Payid: 0</li>\r\n        <li id=\"trxid\">TransactionId:
        0</li>\r\n        <li id=\"issuer\">Issuer: </li>\r\n    </ul>\r\n</div>\r\n</form>\r\n
        \   </div>\r\n</body>\r\n</html>\r\n<script src=\"https://simulator.test.v-psp.com/web-simulator/Content/main.js\"
        type=\"text/javascript\"></script>"
    headers:
      content-security-policy:
      - default-src 'self'; script-src 'self'
      content-type:
      - text/html; charset=utf-8
      correlation-id:
      - 2437c2cf-5675-46ee-9780-76b93a30a28d
      - 2437c2cf-5675-46ee-9780-76b93a30a28d
      date:
      - Tue, 01 Jul 2025 07:37:20 GMT
      pragma:
      - no-cache
      strict-transport-security:
      - max-age=16000000; includeSubDomains; preload;
      transfer-encoding:
      - chunked
      x-content-type-options:
      - nosniff
      x-frame-options:
      - DENY
      x-xss-protection:
      - 1; mode=block
    status:
      code: 200
      message: OK
version: 1
