src/openforms/payments/contrib/ogone/tests/files/vcr_cassettes/OgoneClientTest/test_payment_request_invalid_order_id.yaml

interactions:
- request:
    body: PSPID=maykinmedia&ORDERID=xyz2024%2FOF-123456%2F987654321THISISPROBABLYTOOLONG&AMOUNT=1000&CURRENCY=EUR&LANGUAGE=nl_NL&PMLISTTYPE=2&ACCEPTURL=http%3A%2F%2Ffoo.bar%2Freturn%3Fbazz%3Dbuzz%26action%3Daccept&DECLINEURL=http%3A%2F%2Ffoo.bar%2Freturn%3Fbazz%3Dbuzz%26action%3Dcancel&EXCEPTIONURL=http%3A%2F%2Ffoo.bar%2Freturn%3Fbazz%3Dbuzz%26action%3Dexception&CANCELURL=http%3A%2F%2Ffoo.bar%2Freturn%3Fbazz%3Dbuzz%26action%3Dcancel&BACKURL=http%3A%2F%2Ffoo.bar%2Freturn%3Fbazz%3Dbuzz%26action%3Dcancel&SHASIGN=BEA42C28E1B4B66C3AB7673171C6F9B0D9EE6F91AD9DBB10D51E7B1B30B0B060BEC26B723F4CB6F2EA6009B0CE294FADE87EA4E045FE7D00CF6D740662B10606
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate, br
      Connection:
      - keep-alive
      Content-Length:
      - '633'
      Content-Type:
      - application/x-www-form-urlencoded
      User-Agent:
      - python-requests/2.32.4
    method: POST
    uri: https://ogone.test.v-psp.com/ncol/test/orderstandard_utf8.asp
  response:
    body:
      string: "<html><head><meta http-equiv=\"Content-Type\" content=\"text/html;
        charset=iso-8859-1\"><title>Betaalbevestiging</title><meta name=\"viewport\"
        content=\"width=device-width, initial-scale=1.0, user-scalable=0, minimum-scale=1.0,
        maximum-scale=1.0\"></head><body text=\"#000000\" bgcolor=\"#FFFFFF\" topmargin=\"2\"
        leftmargin=\"4\"><p  align=\"center\"><b><font face=\"Verdana\" size=\"4\">Betaalbevestiging</font></b></p><font
        face=\"Verdana\">\r\n\t<!-- Order overview -->\r\n\t<h2 style=\"display: inline;
        position: absolute; left: -1000px; top: -1000px; width: 0px; height: 0px;
        overflow: hidden;\">Overzicht van de bestelling</h2>\r\n\t<table class=ncoltable1
        border=\"0\" cellpadding=\"2\" cellspacing=\"0\" width=\"95%\" id=\"ncol_ref\">\r\n\t\t\t\r\n\t\t\t\t\t<tr>\r\n\t\t\t\t\t\t\r\n\t\t\t\t\t\t\t<td
        class=ncoltxtl colspan=\"1\" align=\"right\" width=\"50%\"><small>Referentie
        van de bestelling :<!--External reference--></small></td>\r\n\t\t\t\t\t\t\t<td
        class=ncoltxtr colspan=\"1\" width=\"50%\"><small>xyz2024/OF-123456/987654321THISISPROBABLYTOOLONG</small></td>\r\n\t\t\t\t\t\t\r\n\t\t\t\t\t</tr>\r\n\t\t\t\t\t<tr>\r\n\t\t\t\t\t\t\r\n\t\t\t\t\t\t\t<td
        class=ncoltxtl colspan=\"1\" align=\"right\"><small>Totale kostprijs :<!--Total
        to pay--></small></td>\r\n\t\t\t\t\t\t\t<td class=ncoltxtr colspan=\"1\">\r\n\t\t\t\t\t\t\t<small>\r\n\t\t\t\t\t\t\t---\r\n\t\t\t\t\t\t\t</small>\r\n\t\t\t\t\t\t\t</td>\r\n\t\t\t\t\t\t\r\n\t\t\t\t\t</tr>\r\n\t\t\t\t\t<tr>\r\n\t\t\t\t\t\t\r\n\t\t\t\t\t\t\t<td
        class=ncoltxtl colspan=\"1\" align=\"right\"><small>Begunstigde  :<!--Beneficiary--></small></td>\r\n\t\t\t\t\t\t\t<td
        class=ncoltxtr colspan=\"1\"><small>---</small></td>\r\n\t\t\t\t\t\t\r\n\t\t\t\t\t</tr>\r\n\r\n\t\t\t\t\t\r\n\t</table>\r\n\t\r\n<br>\r\n<table
        class=\"ncoltable1\" border=\"0\" cellpadding=\"2\" cellspacing=\"0\" width=\"95%\">\r\n\t<tr>\r\n\t\t<td
        class=\"ncoltxtc\" colspan=\"2\" align=\"center\">\r\n\t\t\tEr is een fout
        opgetreden. Probeer later opnieuw.\r\nBent u de eigenaar of de designer van
        deze website&#63; Meld u dan aan in het backoffice van  om de details van
        de foutmelding te bekijken.\r\n\t\t</td>\r\n\t</tr>\r\n</table>\r\n<input
        type=\"hidden\" name=\"log\" value=\"\">\r\n<br>\r\n\r\n\t\t<script type=\"text/javascript\"
        src=\"js/jquery.core/jquery-3.7.0.min.js\" integrity=\"sha384-GQ8AFQ0PaocgaoU/dMNx0/uJ5UaGMsz1dXhp7v12tf3z/tDFUsqH6JaB/AGVqSf+\"></script>\r\n\t\t<script
        type=\"text/javascript\" src=\"js/jquery.plugins/jquery-migrate-3.4.1.min.js\"
        integrity=\"sha384-3Sq96XaBZcyuE4VzAYBYQCu/HvsVBGcFXYnqOqDIHBeogALpMRGJkn2rpYqIHqUs\"></script>\r\n\t\r\n\t\t<script
        type=\"text/javascript\" nonce=\"E91E776802F879303505988442CE2F077BE5C479D4A4ADA5D0D417470C744A47\">\r\n\t\t\tvar
        OGONE = {};\r\n\t\t\tOGONE.jQuery = $.noConflict(true);\r\n\t\t</script>\r\n\t\r\n\t<script
        type=\"text/javascript\" language=\"JavaScript\" src=\"js/fp/Fp_inc.1.2.js\"
        integrity=\"sha384-RY0LIIN5zluHL26QU1rgCWsyh0x+GPsJSELN/Bt0A9DQqOxh96gP/mZpclQ1aH8H\"></script>\r\n\t<script
        type=\"text/javascript\" language=\"JavaScript\" src=\"base64_inc.js\" integrity=\"sha384-U2In9++bBc35Qz1Qh/+F7ZseLPZPNmX8kLfQa+BnZ/iy9xLCSlXQMyihKJQuedAT\"></script>\r\n\t\r\n<!--
        Further information / Cancel -->\r\n<h2 style=\"display: inline; position:
        absolute; left: -1000px; top: -1000px; width: 0px; height: 0px; overflow:
        hidden;\">Overige gegevens / Annuleren</h2>\r\n<table class=ncoltable3 border=\"0\"
        cellpadding=\"2\" cellspacing=\"0\" width=\"95%\" id=\"ie_cc\" style=\"behavior:url(#default#clientCaps)\">\r\n\t<tr><td
        class=\"ncollogoc\" valign=\"middle\" align=\"center\" width=\"33%\"></td><td
        class=\"ncollogoc\" valign=\"middle\" align=\"center\" width=\"33%\"><a href=\"https&#58;//ogone.test.v-psp.com/ncol/PSPabout.asp?lang=8&pspid=maykinmedia&branding=OGONE&CSRFSP=%2Fncol%2Ftest%2Forderstandard%5Futf8%2Easp&CSRFKEY=0834A8F542FBD7F50766BD988BDD9DCD9EE6C037&CSRFTS=20250818125136\"
        target=\"_blank\"><img border=\"0\" src=\"https&#58;//ogone.test.v-psp.com/images/pp_WorldLine8.png\"
        alt=\"Betaling verwerkt door Worldline\" title=\"Betaling verwerkt door Worldline\"
        vspace=\"2\" id=\"NCOLPP\"></a><br><small><small><a class=\"bottom\" href=\"https&#58;//worldline.com/&#63;lang=8&amp;pspid=maykinmedia&amp;branding=OGONE&amp;CSRFSP=%2Fncol%2Ftest%2Forderstandard%5Futf8%2Easp&amp;CSRFKEY=96C06B918E1E4E9D7F1E750530DB36F088861E69&amp;CSRFTS=20250818125136\"
        target=\"_blank\">Over Worldline</a> |<a class=\"bottom\" href=\"https&#58;//ogone.test.v-psp.com/ncol/security.asp&#63;lang=8&amp;mode=STD&amp;branding=OGONE&amp;CSRFSP=%2Fncol%2Ftest%2Forderstandard%5Futf8%2Easp&amp;CSRFKEY=6B3427C9907EDB58AE8A50651B6A10786CAEB44E&amp;CSRFTS=20250818125136\"
        target=\"_blank\">Veiligheid<!--Security--></a>| <a class=\"bottom\" href=\"https&#58;//worldline.com/en/home/main-navigation/git/office-locations.html&#63;lang=8&amp;mode=STD&amp;branding=OGONE&amp;CSRFSP=%2Fncol%2Ftest%2Forderstandard%5Futf8%2Easp&amp;CSRFKEY=579354B53EDAD8ACA9583BB211BE6E8D6916DB7E&amp;CSRFTS=20250818125136\"
        target=\"_blank\">Wettelijke informatie<!--Legal--></a></small></small></td><td
        class=\"ncollogoc\" valign=\"middle\" align=\"center\" width=\"33%\">&nbsp;</td></tr>\r\n\r\n</table>\r\n</font></html>"
    headers:
      cache-control:
      - private, max-age=0
      content-length:
      - '4737'
      content-security-policy:
      - script-src 'self' 'nonce-E91E776802F879303505988442CE2F077BE5C479D4A4ADA5D0D417470C744A47'
        'unsafe-eval' https://static-eu.payments-amazon.com/cba/js/ https://images-na.ssl-images-amazon.com/images/G/
        https://external-assets.test.cdn.v-psp.com/t/ https://secure.ogone.com/Ncol/Test/
      content-type:
      - text/html; Charset=utf-8
      date:
      - Mon, 18 Aug 2025 10:51:36 GMT
      expires:
      - Mon, 18 Aug 2025 10:50:35 GMT
      set-cookie:
      - sessionTest=11ec198b-5bf7-46df-92ed-d2091d0ac865; path=/ncol/test/; Secure;
        HttpOnly
      strict-transport-security:
      - max-age=16000000; includeSubDomains; preload;
      x-content-type-options:
      - nosniff
    status:
      code: 200
      message: OK
version: 1
